Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: འདི་ནི་ཤེས་རབ་བོ། །
en: This is wisdom;

source: འདི་ནི་ཤེས་རབ་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of wisdom.

source: འདི་ནི་འཆལ་པའི་ཤེས་རབ་བོ། །
en: This is the state of one whose powers of discrimination are faulty;

source: འདི་ནི་འཆལ་པའི་ཤེས་རབ་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of the state of one whose powers of discrimination are faulty.

source: འདི་ནི་ལུས་ཀྱི་ལེགས་པར་སྤྱད་པའོ། །
en: “ ‘This is good behavior with the body;

source: འདི་ནི་ལུས་ཀྱི་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of good behavior with the body.

source: འདི་ནི་ལུས་ཀྱི་ཉེས་པར་སྤྱད་པའོ། །
en: This is bad behavior with the body;

source: འདི་ནི་ལུས་ཀྱི་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of bad behavior with the body.

source: འདི་ནི་ངག་གི་ལེགས་པར་སྤྱད་པའོ། །
en: This is good verbal behavior;

source: འདི་ནི་ངག་གི་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of good verbal behavior.

source: འདི་ནི་ངག་གི་ཉེས་པར་སྤྱད་པའོ། །
en: This is bad verbal behavior;

source: འདི་ནི་ངག་གི་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of bad verbal behavior.

source: འདི་ནི་ཡིད་ཀྱི་ལེགས་པར་སྤྱད་པའོ། །
en: This is good behavior with the mind;

source: འདི་ནི་ཡིད་ཀྱི་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of good behavior with the mind.

source: འདི་ནི་ཡིད་ཀྱི་ཉེས་པར་སྤྱད་པའོ། །
en: This is bad behavior with the mind;

source: འདི་ནི་ཡིད་ཀྱི་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: this is the result of bad behavior with the mind.

source: འདི་ནི་དགེ་བའོ། །
en: “ ‘This is virtue.

source: འདི་ནི་མི་དགེ་བའོ། །
en: This is vice.

source: འདི་ནི་བྱ་བའོ། །
en: This is what should be done.

source: འདི་ནི་བྱ་བ་མ་ཡིན་པའོ། །
en: This is what should not be done.

source: འདི་ནི་བྱས་ན་ཡུན་རིང་པོའི་དོན་དང་། ཕན་པ་དང་། བདེ་བ་དང་། གྲུབ་པ་དང་། བདེ་བར་འགྱུར་རོ། །
en: Doing this is to one’s benefit, prosperity, bliss, and aims for a long time, but doing this is not to one’s benefit, prosperity, bliss, and aims for a long time.’

source: ཞེས་དེ་ལྟར་དགེ་བའི་བཤེས་གཉེན་དེ་དག་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན། ཡང་དག་པར་འཛིན་དུ་འཇུག །ཡང་དག་པར་གཟེངས་སྟོད། ཡང་དག་པར་དགའ་བར་མཛད་དོ། །དེ་ནས་དེ་དག་སྣོད་དུ་རུང་བར་མཁྱེན་ནས་ཟབ་མོའི་གཏམ་འདི་ལྟ་སྟེ།
en: “This, indeed, is how those companions in what is good demonstrate it to noble sons and daughters, how they enable them to grasp it, how they make them excited about it, how they make them pleased about it.

source: སྟོང་པ་ཉིད་ཀྱི་གཏམ་དང་། མཚན་མ་མེད་པའི་གཏམ་དང་། སྨོན་པ་མེད་པའི་གཏམ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་གཏམ་དང་། མ་སྐྱེས་པའི་གཏམ་དང་། མ་བྱུང་བའི་གཏམ་དང་། བདག་མེད་པ་དང་།
en: And then, once they know that someone is a worthy recipient of the Dharma, they offer profound teachings—for instance, teachings on emptiness, teachings on groundlessness, teachings on desirelessness, teachings on what is unconditioned, teachings on what is not born and does not arise, and teachings on the lack of a self, the lack of a being, the lack of a life force, and the lack of a person.

source: སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གང་ཟག་མེད་པའི་གཏམ་རབ་ཏུ་སྟོན་ཏོ། །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་མོའི་གཏམ་འདི་ལྟ་སྟེ། འདི་ཡོད་པའི་ཕྱིར་འདི་འབྱུང་།
en: “They offer profound teachings on dependent arising, saying, ‘This being so, this comes to be.

source: འདི་མེད་པའི་ཕྱིར་འདི་མི་འབྱུང་།
en: This not being so, this does not come to be.

source: འདི་ཡོད་པའི་ཕྱིར་འདི་སྐྱེ།
en: This being so, this arises.

source: འདི་མེད་པའི་ཕྱིར་འདི་འགག་པ་འདི་ལྟ་སྟེ།
en: This not being so, this ceases.’

source: མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས།
en: “And they also say, ‘With ignorance as the condition, latent tendencies come to be;

source: འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ།
en: with latent tendencies as the condition, consciousness comes to be;

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས།
en: with consciousness as the condition, name and form come to be;

source: མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག །
en: with name and form as the condition, the six sense spheres come to be;

source: སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ།
en: with the six sense spheres as the condition, sense contact comes to be;

source: རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ།
en: with sense contact as the condition, feeling comes to be;

source: ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ།
en: with feeling as the condition, craving comes to be;

source: སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ།
en: with craving as the condition, clinging comes to be;

source: ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ།
en: with clinging as the condition, becoming comes to be;

source: སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ།
en: with becoming as the condition, birth comes to be;

source: སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་།
en: and with birth as the condition, old age and death come to be, along with grief, lamentation, suffering, displeasure, and despair.

source: འཁྲུག་པ་རྣམས་འབྱུང་སྟེ། དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པ་འདི་འབྱུང་བར་འགྱུར་རོ། །
en: Such is the origin of this whole great mass of suffering.

source: འདི་འགགས་པས་འདི་འགག་སྟེ།
en: From the ceasing of that, this ceases.

source: འདི་ལྟར་མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགག །
en: So, from the ceasing of ignorance, latent tendencies cease;

source: འདུ་བྱེད་འགགས་པས་རྣམ་པར་ཤེས་པ་འགག །
en: from the ceasing of latent tendencies, consciousness ceases;

source: རྣམ་པར་ཤེས་པ་འགགས་པས་མིང་དང་གཟུགས་འགག །
en: from the ceasing of consciousness, name and form cease;

source: མིང་དང་གཟུགས་འགགས་པས་སྐྱེ་མཆེད་དྲུག་འགག །
en: from the ceasing of name and form, the six sense spheres cease;

source: སྐྱེ་མཆེད་དྲུག་འགགས་པས་རེག་པ་འགག །
en: from the ceasing of the six sense spheres, sense contact ceases;

source: རེག་པ་འགགས་པས་ཚོར་བ་འགག་ཚོར་བ་འགགས་པས་སྲེད་པ་འགག།
en: from the ceasing of sense contact, feeling ceases; from the ceasing of feeling, craving ceases;

source: སྲེད་པ་འགགས་པས་ལེན་པ་འགག །
en: from the ceasing of craving, clinging ceases;

source: ལེན་པ་འགགས་པས་སྲིད་པ་འགག །
en: from the ceasing of clinging, becoming ceases;

source: སྲིད་པ་འགགས་པས་སྐྱེ་བ་འགག །
en: from the ceasing of becoming, birth ceases;

source: སྐྱེ་བ་འགགས་པས་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་།
en: from the ceasing of birth, aging and death cease, along with grief, lamentation, suffering, displeasure, and despair.

source: འཁྲུགས་པ་རྣམས་འགག་པར་འགྱུར་ཏེ། དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པ་འདི་འགག་པར་འགྱུར་རོ། །
en: Such is the cessation of this whole great mass of suffering.

source: དེ་ལ་དོན་དམ་པར་ན་འབྱུང་བའམ། འགག་པའི་ཆོས་གང་ཡང་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་ཐམས་ཅད་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྟེ། བདག་པོ་མེད་པ། བྱེད་པ་པོ་མེད་པ།
en: “ ‘In the respect, moreover, from the perspective of the ultimate truth, nothing can be found of which there is the arising or the cessation, and that is because all things that are dependently arisen are without an owner, a doer, or an experiencer.

source: ཚོར་བ་པོ་མེད་པ། རྒྱུ་དང་རྐྱེན་ལས་བྱུང་བའོ། །འདི་ལ་འཇུག་པའམ། ལྡོག་པ་འམ། རྗེས་སུ་འཇུག་པའི་ཆོས་གང་ཡང་མེད་དེ།
en: Furthermore, with respect to what comes into being through causes and conditions, there is no thing that comes into being, turns back into nonbeing, or returns into being.

source: གཞན་དུ་ན་ཡང་དག་པ་མ་ཡིན་པ། ཀུན་ཏུ་གཏི་མུག་པས་ཁམས་གསུམ་པ་འདོགས་པར་འགྱུར་ཏེ།
en: The notion that there are the three worlds comes into being as a result of bewilderment caused by what is unreal, and not otherwise.

source: ཉོན་མོངས་པའི་རྗེས་སུ་འཇུག་པ་དང་།
en: The notion persists through the afflictions;

source: ལས་ཀྱི་རྗེས་སུ་འཇུག་པ་དང་།
en: it persists through action;

source: སྡུག་བསྔལ་གྱི་རྗེས་སུ་འཇུག་པའི་འདོགས་པ་འབྱུང་བ་ནི་མ་གཏོགས་སོ། །
en: it persists through suffering.

source: ཡང་དག་པ་མ་ཡིན་པ་ཀུན་ཏུ་གཏི་མུག་པ་དེ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བརྟགས་ན་ཆོས་གང་ཡང་ཆོས་གང་གི་བྱེད་པ་པོར་འགྱུར་བ་མེད་དེ།
en: However, if one were to examine this false conception from the perspective of the true nature of things, there is no thing whatsoever, nor is there a doer of anything at all.

source: གང་ལ་བྱེད་པ་པོར་མི་དམིགས་པ་དེ་ལ་འཇུག་པ་མེད། ལྡོག་པ་མེད་དོ་ཞེས་བརྗོད་པར་བྱའོ། །
en: Where a doer cannot be found, in such a case it should be said that nothing comes into being, turns back into nonbeing, or returns into being.’

source: དེ་ཆོས་ཟབ་མོའི་གཏམ་དེ་ལྟ་བུ་ཐོས་ནས་སོམ་ཉི་མེད་དོ། །
en: “Hearing such a profound teaching about the nature of things, noble sons and daughters do not hesitate.

source: ཐེ་ཙོམ་མི་ཟའོ། །ཆོས་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པར་འཇུག་སྟེ།
en: They do not doubt.

source: དེ་གཟུགས་ལ་མི་ཆགས་སོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་མི་ཆགས་སོ། །
en: They comprehend that all things have the nature of being unbound, and so they do not become bound to form, and they do not become bound to feeling, conception, latent tendencies, or consciousness.

source: དེ་མིག་དང་། གཟུགས་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་ལ་མི་ཆགས་སོ། །རྣ་བ་དང་། སྣ་དང་།
en: They do not become bound to the eye, form, or visual consciousness.

source: ལྕེ་དང་། ལུས་དང་། ཡིད་དང་། ཆོས་རྣམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་མི་ཆགས་སོ། །
en: Likewise, they do not become bound to the ear, the nose, the tongue, or the body, or to the mind, mental objects, or the consciousness of mind.

source: ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་དང་། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་དབེན་པར་ཡིད་ཆེས་སོ། །
en: They believe that all things are naturally empty and naturally isolated and free.

source: གྲོགས་པོ་དག་དེ་ལྟར་དད་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་མཐོང་བ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར། །
en: “A bodhisattva who is grounded in such a belief, friends, does not stop seeing the buddhas.

source: དམ་པའི་ཆོས་ཉན་པ་དང་།
en: He does not stop listening to the Dharma.

source: དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱེད་པ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་རོ། །
en: He does not stop serving the Saṅgha.

source: དེ་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་རང་སངས་རྒྱས་མཐོང་བ་དང་། ཆོས་མཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱ་བ་དང་བྲལ་བར་མི་འགྱུར་རོ། །
en: Wherever he is born, he is not separated from seeing the buddhas, hearing the Dharma, and serving the Saṅgha.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྤྱན་སྔར་སྐྱེ་བར་འགྱུར་རོ། །དེར་སྐྱེས་ནས་ཀྱང་བརྩོན་འགྲུས་བརྩམས་པར་འགྱུར།
en: He is born with his face turned toward the blessed realized ones, and from the moment of his birth he strives with heroic effort.

source: དགེ་བའི་ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་པར་འགྱུར་རོ། །དེ་བརྩོན་འགྲུས་བརྩམས་པས་ཁྱིམ་གྱི་གནས་དོན་དུ་གཉེར་བར་མི་འགྱུར་རོ། །
en: Striving with heroic effort and focused on the search for the good Dharma, he has no desire for the life of a householder.

source: ཆུང་མ་དང་། བུ་དང་། བུ་མོ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་།
en: He has no desire to become attached to a household of wives, sons, daughters, male servants, female servants, attendants, and hired dayworkers.

source: ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་ཡོངས་སུ་འཛིན་པས་ཡོངས་སུ་སྤྱོད་པ་དོན་དུ་གཉེར་བར་མི་འགྱུར་ཏེ། དེ་ན་ཚོད་གཞོན་ནུར་རྣམ་པར་རྩེ་བ་ལ་མི་དགའ་བས་ན་ཚོད་མཛེས་པ་ལ་བབ་པའི་ཚེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བསྟན་པ་ལ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་མྱུར་དུ་རབ་ཏུ་འབྱུང་ངོ་། །
en: As a youth, he does not engage in child’s play or with sensual pleasures even for a moment, and even though he is good-looking, he sets out from home in the prime of his life and enters the homeless life out of faith in the teachings of the blessed buddhas.

source: དེ་དད་པས་རབ་ཏུ་བྱུང་ནས་དགེ་བའི་བཤེས་གཉེན་རྣམས་དང་། དགེ་བའི་གྲོགས་པོ་དགེ་བ་ཐོབ་པར་བྱེད་པ་རྣམས་དང་དགེ་བའི་བསམ་པ་འཐོབ་བོ། །
en: “Those who enter the homeless life acquire companions in what is good, become companions of what is good, help others to attain what is good, and become motivated by what is good.

source: དེ་དགེ་བའི་བསམ་པ་དང་ལྡན་པས་དགེ་བའི་ཆོས་རྣམས་ཉན་ཏོ། །
en: Those who are motivated by what is good listen to teachings about what is good, but their central concern is practice;

source: སྒྲུབ་པ་སྙིང་པོར་བྱེད་ཀྱི་ཚིག་ལྷུར་ལེན་པའི་བློ་དང་ལྡན་པ་མ་ཡིན་ནོ། །
en: they are not endowed with mere verbal intelligence.

source: མང་དུ་ཐོས་པ་ཡོངས་སུ་བཙལ་བའི་ཕྱིར་བརྩོན་འགྲུས་བརྩམས་པ་ཡང་ཡིན་ཏེ། ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་ཀྱང་ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་འཐོབ་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ལ་མི་རེ་བར་གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་ཏོ། །
en: After having strived with heroic effort in a search for extensive learning, they teach the Dharma expansively to others exactly as they heard it and without a thought for material compensation or an expectation of profit, favor, or fame.

source: བདག་གི་ཚིག་གི་རྗེས་སུ་འབྲང་བར་གཞན་དག་ལ་ཆོས་མི་སྟོན་ཏོ། །དེ་ཇི་ལྟར་ཐོས་པ་དང་། ཇི་ལྟར་གནས་པ་དེ་བཞིན་དུ་གཞན་དག་ལ་ཆོས་སྟོན་ཏོ། །
en: They teach the Dharma to others not by relying upon their own words, but they teach the Dharma to others exactly as they heard it and exactly as it has been established.

source: ཆོས་ཉན་པ་རྣམས་ལ་ནི་བྱམས་པ་ཆེན་པོ་འཐོབ་བོ། །
en: “They obtain a great love for those who hear the Dharma.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་དོ། །
en: They generate great compassion for all beings.

source: དེ་མང་དུ་ཐོས་པར་གྱུར་པས་ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་ཡིན། འདོད་པ་ཆུང་བ་དང་། ཆོག་ཤེས་པ་དང་། རབ་ཏུ་དབེན་པ་དང་། མགུ་སླ་བ་དང་།
en: Once they have extensive learning, they give no regard to their bodies or their lives, and they have few wants.

source: གསོ་སླ་བ་དང་། དགོན་པ་དང་། བས་མཐར་མངོན་པར་དགའ་བ་ཡིན། ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་ཀྱི་དོན་ལ་ཡོངས་སུ་རྟོག་པ་ཡིན་ནོ། །
en: They are content, live in total isolation, are easily satisfied, require little support, and are quite happy in forests and borderlands where they spend their time carefully investigating the Dharma just as they have learned it.

source: དོན་ལ་རྟོན་པ་ཡིན་ཏེ་ཚིག་འབྲུ་ལ་རྟོན་པ་མ་ཡིན་ནོ། །
en: They place their confidence in the meaning;

source: ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་སྟོན་པར་གྱུར་པ་ཡིན་ནོ། །
en: they do not place their confidence in the words, and they become beings in whom the world with its gods, humans, and asuras places its confidence.

source: བདག་འབའ་ཞིག་གི་ཕྱིར་བརྩོན་པ་མ་ཡིན་གྱི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཕྱིར་བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོ་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡོངས་སུ་ཚོལ་ལོ། །
en: They do not endeavor for themselves alone, but examine thoroughly and for the sake of all beings the unsurpassably great self, which is the knowledge of the buddhas.

source: བག་ཡོད་པ་ལྷུར་ལེན་པ་ཡང་ཡིན་ཏེ།
en: “They are intent on being watchful.

source: དེ་ལ་བག་ཡོད་པ་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What sort of watchfulness is meant here?

source: དབང་པོ་སྡོམ་པའོ། །
en: It is what restrains the sense faculties.

source: དེ་མིག་གིས་གཟུགས་རྣམས་མཐོང་ནས། མཚན་མར་མི་འཛིན་ཅིང་མངོན་རྟགས་སུ་མི་འཛིན་པ་ཡིན་ནོ། །དེ་གཟུགས་རྣམས་ཀྱི་རོ་མྱང་བ་དང་། ཉེས་དམིགས་དང་།
en: After seeing forms with the eye, they do not grasp on to their general features or secondary characteristics.

source: འབྱུང་བ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: They know the pleasure and the misery of such forms, and the freedom from them, just as they really are.

source: དེ་བཞིན་དུ་རྣ་བས་སྒྲ་རྣམས་དང་། སྣས་དྲི་རྣམས་དང་། ལྕེས་རོ་རྣམས་དང་། ལུས་ཀྱིས་རེག་བྱ་རྣམས་དང་། ཡིད་ཀྱིས་ཆོས་རྣམས་ཤེས་ནས་མཚན་མར་མི་འཛིན་ཅིང་མངོན་རྟགས་སུ་མི་འཛིན་པ་ཡིན་ཏེ།
en: In the same way, after cognizing sounds with the ear, smells with the nose, tastes with the tongue, tactile sensations with the body, and mental objects with the mind, they do not grasp on to their general features or secondary characteristics.

source: ཆོས་རྣམས་ཀྱི་རོ་མྱང་བ་དང་།
en: They know the pleasure and the misery of such things, and the freedom from them, just as they really are.

source: ཉེས་དམིགས་དང་འབྱུང་བ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ་འདི་ནི་བག་ཡོད་པ་ཞེས་བྱའོ། །
en: This is called watchfulness.

source: གཞན་ཡང་བག་ཡོད་པ་ནི་གང་རང་གི་སེམས་འདུལ་བ་དང་། གཞན་གྱི་སེམས་རྗེས་སུ་སྲུང་བ་དང་། ཉོན་མོངས་པ་ལ་དགའ་བ་སེལ་བ་དང་། ཆོས་ལ་དགའ་བའི་རྗེས་སུ་འཇུག་པ་དང་།
en: “Moreover, watchfulness is also controlling one’s mind, protecting the minds of others, reducing one’s delight in the afflictions, increasing one’s delight in the Dharma, and conforming to one’s delight in the Dharma.

source: འདོད་པ་ལ་རྣམ་པར་རྟོག་པ་དང་། གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་འཚེ་བའི་རྣམ་པར་རྟོག་པ་རྣམས་ཀྱི་རྒྱུ་བ་མེད་པ་དང་།
en: It is the state of not pursuing preoccupations of sensual desire, ill will, and cruelty.

source: མི་དགེ་བའི་རྩ་བ་ཆགས་པ་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་རྒྱུ་བ་མེད་པ་དང་།
en: It is the state of not pursuing greed, anger, delusion, and the roots of vice.

source: ལུས་ཀྱི་ཉེས་པར་སྤྱོད་པའི་རྒྱུ་བ་མེད་པ་དང་།
en: It is the state of not pursuing bad behavior with one’s body.

source: ངག་གི་ཉེས་པར་སྤྱོད་པའི་རྒྱུ་བ་མེད་པ་དང་།
en: It is the state of not pursuing bad behavior with one’s speech.

source: ཡིད་ཀྱི་ཉེས་པར་སྤྱོད་པའི་རྒྱུ་བ་མེད་པ་དང་།
en: It is the state of not pursuing bad behavior with one’s mind.

source: ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པའི་རྒྱུ་བ་མེད་པ་དང་།
en: It is the state of not pursuing the objects of one’s indiscriminate attention.

source: སྡིག་པ་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུ་བ་མེད་པ་སྟེ།
en: It is the state of not pursuing all bad and evil things.

source: འདི་ནི་བག་ཡོད་པ་ཞེས་བྱའོ། །
en: This is called watchfulness.

source: གྲོགས་པོ་དག་དེ་ལྟར་ན་བག་ཡོད་པར་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དད་པ་དང་། བག་ཡོད་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: “Accordingly, friends, the bodhisattva who is watchful and has endeavored to pay careful attention has belief.

source: གསང་བ་པའི་བདག་པོ་དད་པ་མང་བ་དང་། རྟག་ཏུ་འཐུན་པ་དང་། ཆོས་དོན་དུ་གཉེར་བ་དང་ཆོས་འདོད་པར་བྱའོ། །
en: Be watchful and a believer, Lord of the Guhyakas, have an abundance of faith, always be in harmony, be intent on the Dharma, and desire the Dharma.

source: གསང་བ་པའི་བདག་པོ་དད་པ་དང་ལྡན་པའི་སྐྱེས་བུ་གང་ཟག་ནི་འཇིག་རྟེན་ཕ་རོལ་དུ་ངན་འགྲོའི་འཇིགས་པ་མེད་པ་ཡིན་ཏེ།
en: Indeed, those who have belief, Lord of the Guhyakas, whether human or another type of individual, do not have any fear of a bad rebirth in the next world.

source: དེའི་སེམས་ཉེས་པར་སྤྱོད་པ་ལ་མི་འགྲོའོ། །འཕགས་པ་རྣམས་ཀྱིས་བསྔགས་པར་འགྱུར་རོ། །
en: They do not apply their minds to bad behavior, and they are worthy of the praise of the noble ones.

source: གསང་བ་པའི་བདག་པོ་གཞན་ཡང་ཆོས་སྤྱོད་པ་ལ་གནས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ཆོས་དང་ལྡན་པར་འགྲོ་བ་ཡིན་ཏེ།
en: “Furthermore, Lord of the Guhyakas, individuals who are established in the practice of the Dharma go to places that conform with the Dharma.

source: སངས་རྒྱས་མཐོང་བ་རྣམས་མཉེས་པར་བྱེད་དོ། །འཕགས་པའི་ལམ་ལ་ཡང་གནས་སོ། །ཆེ་བ་ཉིད་ཀྱང་འཐོབ་བོ། །
en: They do not avoid the sight of the buddhas, and having been set firmly on the noble path, they attain greatness of character.

source: གསང་བ་པའི་བདག་པོ་ཆེ་བ་ཉིད་ཐོབ་ནས་ཆེ་བ་ཉིད་འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱེད་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །
en: This greatness of character, Lord of the Guhyakas, which they bring to fulfillment, is itself the aspiration for awakening in order to attain the knowledge of the realized ones.

source: གསང་བ་པའི་བདག་པོ་གཞན་ཡང་བདེ་བ་ཐོབ་པར་འདོད་པའི་སྐྱེས་བུ་གང་ཟག་གིས་ཤིན་ཏུ་གྲུབ་པ་དང་། བདེ་བ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ལ་བརྩོན་པར་བྱའོ། །
en: What is more, Lord of the Guhyakas, humans and other individuals who want to experience bliss ought to make an effort to achieve complete cessation, which is the final rest from effort.

source: གསང་བ་པའི་བདག་པོ་སྔོན་གྱི་དགེ་བའི་རྩ་བ་རྣམས་ཀྱིས་འོངས་པའི་འཁོར་འདི་ཇི་ལྟར་ལྷང་ངེ་བ་ལ་ལ་ལྟོས།
en: “Look at how this assembly shines, Lord of the Guhyakas! It has come together by means of the roots of past virtue.

source: གསང་བ་པའི་བདག་པོ་དེ་ལ་དགེ་བའི་རྩ་བ་ལས་ཡོངས་སུ་མི་ཉམས་པར་བྱ་བའི་ཕྱིར་ཤིན་ཏུ་བརྩོན་པར་བྱའོ། །
en: Therefore, Lord of the Guhyakas, one should make an effort so that roots of virtue are not completely ruined.

source: གསང་བ་པའི་བདག་པོ་ཇི་ལྟར་དགེ་བའི་རྩ་བ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་ཞེ་ན།
en: And how, Lord of the Guhyakas, are roots of virtue not ruined?

source: གསང་བ་པའི་བདག་པོ་བག་ཡོད་པར་གནས་པའི་ལྷ་དང་མི་རྣམས་ནི་དགེ་བའི་རྩ་བ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་རོ། །
en: The roots of virtue of those gods and humans who live in watchfulness are not ruined, Lord of the Guhyakas.

source: དེ་ལ་བག་ཡོད་པ་ནི་སེམས་རྗེས་སུ་སྲུང་བ་དང་།
en: Therefore, watchfulness guards the mind.

source: ཡུལ་འདོར་བ་དང་། འདོད་པ་ལ་དགའ་བ་རྣམ་པར་སྤོང་བ་དང་། ཆོས་ཀྱི་དགའ་བ་ལ་བསྟེན་པ་དང་།
en: It drives away sense objects, it shuns the delight of sense pleasures, and it indulges the delight of the Dharma.

source: འདོད་པ་ལ་རྣམ་པར་རྟོག་པ་དང་། གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་འཚེ་བའི་རྣམ་པར་རྟོག་པ་རྣམས་ཀྱི་རྒྱུ་བ་མེད་པ་དང་། མི་དགེ་བ་རྣམས་དང་།
en: It is the state of not pursuing preoccupations of sensual desire, ill will, and cruelty.

source: ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་རྣམས་ཀྱི་རྒྱུ་བ་མེད་པ་དང་།
en: It is the state of not pursuing the vices that are the objects of one’s indiscriminate attention.

source: ཆགས་པ་དང་། ཞེ་སྡང་དང་། གཏི་མུག་རྣམས་ཀྱི་རྒྱུ་བ་མེད་པ་དང་།
en: It is the state of not pursuing greed, anger, and delusion.

source: ལུས་དང་ངག་དང་།
en: It is the state of not pursuing the grave offenses of the body, speech, and mind.

source: ཡིད་ཀྱི་གནས་ངན་ལེན་རྣམས་ཀྱི་རྒྱུ་བ་མེད་པ་ནས་ཉམས་པའི་ཆ་དང་འཐུན་པར་འགྱུར་བའི་ཆོས་ཐམས་ཅད་ཀྱི་བར་གྱི་རྒྱུ་བ་མེད་པ་སྟེ།
en: It is the state of not pursuing anything connected with ruin.

source: གསང་བ་པའི་བདག་པོ་སུ་དད་པ་དང་ལྡན་ཞིང་བག་ཡོད་པ་དང་ལྡན་པ་དེས་བརྩོན་འགྲུས་གང་གིས་བག་ཡོད་པར་བྱེད་པ་དང་། དད་པར་བྱེད་པའི་ཆོས་དེ་དག་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་བའི་བརྩོན་འགྲུས་དང་ལྡན་པར་བྱའོ། །
en: “Those who are watchful and have belief, Lord of the Guhyakas, ought to make a heroic effort that conforms with these qualities, and then, by means of such heroic effort, they will gather those qualities of which watchfulness and belief are the causes.

source: གསང་བ་པའི་བདག་པོ་སུ་དད་པ་དང་། བག་ཡོད་པ་དང་། བརྩོན་འགྲུས་དང་ལྡན་པ་དེས་དྲན་པ་དང་། ཤེས་བཞིན་ལ་བརྩོན་པར་བྱའོ། །
en: Those who are watchful, have belief, and make heroic effort, Lord of the Guhyakas, ought to make an effort to achieve mindfulness and circumspection.

source: དྲན་པ་དང་ཤེས་བཞིན་དེས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ཆུད་ཟ་བར་མི་འགྱུར་རོ། །
en: With mindfulness and circumspection, none of the qualities that are conducive to awakening are ruined.

source: གསང་བ་པའི་བདག་པོ་སུ་དད་པ་དང་། བག་ཡོད་པ་དང་། བརྩོན་འགྲུས་དང་། དྲན་པ་དང་། ཤེས་བཞིན་དང་ལྡན་པ་དེས་ཚུལ་བཞིན་དུ་སྦྱོར་བ་ལ་བརྩོན་པར་བྱའོ། །
en: Those who are watchful, have belief, make heroic effort, and are mindful and circumspect, Lord of the Guhyakas, ought to practice with care.

source: གསང་བ་པའི་བདག་པོ་ཚུལ་བཞིན་དུ་སྦྱོར་བ་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་ཡོད་པ་དེ་ཡང་ཡོད་པར་རབ་ཏུ་ཤེས་སོ། །
en: Indeed, Lord of the Guhyakas, the bodhisattva who has practiced with care knows whether something exists or does not exist.

source: གང་མེད་པ་དེ་ཡང་མེད་པར་རབ་ཏུ་ཤེས་སོ། །དེ་ལ་ཡོད་པ་ནི་གང་། མེད་པ་ནི་གང་ཞེ་ན།
en: In this respect, what exists and what does not exist?

source: ཡང་དག་པར་སྦྱོར་བ་དང་ལྡན་པ་ལ་ནི་འཕགས་པའི་རྣམ་པར་གྲོལ་བ་ཡོད་དེ།
en: “There is the noble liberation for those who have practiced correctly.

source: འདི་ནི་ཡོད་པ་ཞེས་བྱའོ། །
en: This, it is said, exists.

source: དེ་ལ་མེད་པ་གང་ཞེ་ན།
en: In this regard, what does not exist?

source: ལོག་པར་སྦྱོར་བ་དང་། ལྡན་པ་ལ་ནི་འཕགས་པའི་རྣམ་པར་གྲོལ་བ་མེད་དེ།
en: There is no noble liberation for those who have practiced incorrectly.

source: དེ་ནི་མེད་པ་ཞེས་བྱའོ། །
en: This, it is said, does not exist.

source: གཞན་ཡང་ལས་དང་རྣམ་པར་སྨིན་པ་ནི་ཡོད་དོ། །
en: Moreover, action and consequence exist.

source: གང་ལས་དེ་དང་རྣམ་པར་སྨིན་པ་དང་ལྡན་པ་དེ་ནི་མེད་དོ། །
en: The one of whom there is the action and consequence does not exist.

source: གཞན་ཡང་ཀུན་རྫོབ་ཏུ་མིག་དང་། རྣ་བ་དང་།
en: Moreover, conventionally, the eye, ear, nose, tongue, body, and mind exist.

source: སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ནི་ཡོད་དོ། །གང་མིག་ནས་ཡིད་ཀྱི་བར་དང་ལྡན་པ་ནི་མེད་དོ། །
en: One who possesses the eye, ear, nose, tongue, body, and mind does not exist.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་བརྩམས་པ་ལ་ནི་བྱང་ཆུབ་ཡོད་དོ། །
en: “Moreover, for a bodhisattva who has strived with heroic effort, awakening exists.

source: ལེ་ལོ་ཅན་ལ་ནི་བྱང་ཆུབ་མེད་དོ། །
en: For one who is lazy, awakening does not exist.
